[{"title":"You all call me fugitive, which court has ever convicted me: Lalit Modi","content":"Lalit Modi on Sunday took to Instagram to speak about various issues after he revealed his relationship with Sushmita Sen. He wrote, \"[Though you all] call me a \"fugitive\"...tell me which court has ever convicted me...None…Everyone knows how difficult it is to do business in India.\" Speaking about IPL, he said, “Everyone...knows that I did it all alone\"","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"business"},{"title":"World's biggest NFT marketplace OpenSea fires 20% staff citing 'crypto winter'","content":"The world's first and biggest NFT marketplace OpenSea has fired 20% of its employees citing \"cryptocurrency winter\" and \"broad macroeconomic instability\". CEO Devin Finzer shared the news on Twitter and said the affected employees will be provided with a generous severance and healthcare coverage into 2023. He added that the company will also help in the placement of these employees. ","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"business"},{"title":"BCCI had ₹40 cr in bank when I joined & ₹47,680 cr when I was banned: Lalit","content":"In an Instagram post, Lalit Modi asserted that he neither took any government favour nor any bribes from anyone. He added, “I was born with a diamond spoon...When I joined BCCI, it had ₹40 crore in the bank. I joined on my birthday on November 29, 2005. Guess what was in the bank when I was banned - ₹47,680 crore.\"","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"business"},{"title":"A fighter to the core: Mahindra praises PV Sindhu after she wins Singapore Open","content":"Businessman Anand Mahindra took to Twitter to praise PV Sindhu after she won the Singapore Open. Sharing a tweet by Doordarshan Sports which had an old image of Sindhu, Mahindra wrote, \"That’s not just her facial expression, but the expression of her soul. A fighter to the core...Never getting demoralised by a slump. Teaching us how to rise again.\"","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"business"},{"title":"Twitter's sudden speed for trial after 2 months of foot-dragging is a tactic: Musk","content":"Tesla CEO Elon Musk has opposed Twitter's request for a fast-track trial over the $44 billion deal termination. In a filing, Musk said, \"Twitter's sudden request for warp speed after two months of foot-dragging...is its latest tactic to shroud the truth about spam accounts long enough to railroad defendants into closing.\" Twitter has requested that the trial begin in September. \n","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"business"},{"title":"Amazon pauses work on 6 new US office buildings to redesign for hybrid work","content":"Amazon is pausing construction of six new office buildings in Bellevue and Nashville as it seeks to redesign workspaces for hybrid work. \"We want to make sure that we design them in a way that meets our employees' needs in future,\" Amazon said. Amazon's plan to create 30,000 jobs in Bellevue and Nashville won't be affected by the construction pause.","author":"Hiral Goyal","date":"16 Jul","source":null,"category":"business"},{"title":"Twitter's lawsuit against Musk gets 90-min 1st court hearing on July 19","content":"Twitter’s lawsuit against Tesla CEO Elon Musk over terminating the $44 billion acquisition deal will be first heard in court on July 19. Kathaleen McCormick, the Chancellor of Delaware's Court of Chancery, has set a 90-minute hearing. Notably, Twitter has requested that the trial begins in September because the merger agreement with Musk terminates on October 25.","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"business"},{"title":"It is not a sacrifice at all: Bill Gates on plan to give away all his wealth","content":"Microsoft Co-founder Bill Gates, who plans to give away all his wealth, said, \"My giving this money is not a sacrifice at all.\" He added, \"I feel privileged to be involved in tackling these great challenges...and I believe I have an obligation to return my resources to society.\" Gates is currently the world's fourth richest person with $113 billion wealth.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"business"},{"title":"11 SEBI officials' email accounts hacked & used to send 34 emails, FIR filed","content":"Mumbai police has filed an FIR after the Securities and Exchange Board of India (SEBI) approached them, alleging the email accounts of its 11 officials had been hacked and used to send as many as 34 emails by unknown persons. \"It was a small incident. CERT-IN is fully in the loop. No sensitive data was lost,\" the markets regulator said.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"business"},{"title":"Unjustifiable request: Musk files motion against Twitter's bid to fast-track trial","content":"Tesla CEO Elon Musk has filed a motion opposing Twitter's request to fast-track a trial over the $44 billion deal, terming it an \"unjustifiable request\". While Twitter has requested the trial begin in September because the merger agreement with Musk terminates on October 25, Musk has requested a trial date on or after February 13, 2023. ","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"business"},{"title":"How a startup should operate: Mahindra on old video of Man City's 44-pass goal","content":"Businessman Anand Mahindra took to Twitter to share a 2018 video of Manchester City's 44-pass goal against Manchester United and wrote, \"A lesson in teamwork...But also an analogy for how a startup...needs to operate.\" He further said that success comes from going \"back and forth, trying new angles of approach and going for the kill when strategic path is clear\".","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"business"},{"title":"Which household items will get costlier from tomorrow due to changes in GST rules?","content":"Pre-packaged and labelled food items like curd, lassi and buttermilk will get costlier from July 18 as they'll attract 5% GST. Jaggery, khandsari sugar, puffed rice will no longer be exempt from GST. Kitchen utensils like knives, spoons, forks, and stationery items like pencil sharpeners, maps, globes and electrical appliances such as LED lights and fixtures will also get costlier.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"business"},{"title":"Lalit shares pics with PM Modi & others amid trolling, says 'was born with diamond spoon'","content":"While criticising people trolling him over his relationship with Sushmita Sen, Lalit Modi shared old pictures with PM Narendra Modi, Amit Shah, UK Prince Charles, Dalai Lama, Nelson Mandela among other personalities. He said he doesn't care about people calling him a fugitive, adding, \"I was born with a 'diamond spoon'. I didn't take a bribe or ever needed to.\"","author":"Arshiya Chopra","date":"17 Jul","source":null,"category":"business"},{"title":"Withdraw GST on healthcare services: IMA writes letter to Finance Minister","content":"The Indian Medical Association (IMA) has written a letter to Union Finance Minister Nirmala Sitharaman requesting to exempt healthcare services from GST. Citing various recommendations by the 47th GST Council on certain facilities that were earlier exempted from GST and will be taxed post-July 18, IMA said the cost \"will add a significant additional cost to the healthcare of people.\"","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"business"},{"title":"IndiGo not following maintenance procedures, technicians tell Airbus; airline replies","content":"IndiGo's technicians have written a letter to aircraft manufacturer Airbus complaining that the airline is not following standard maintenance procedures leading to risking passengers' safety. They said the technical staff has been on a strike for a couple of days and the airline is operating flights without proper maintenance. Meanwhile, IndiGo denied the allegations, calling them \"baseless\".","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"business"},{"title":"Who are the highest-paid FMCG CEOs in India in FY22?","content":"Marico’s MD and CEO Saugata Gupta emerged as the highest-paid FMCG CEO as his total pay in FY22 jumped by 157% from ₹14.03 crore in FY21 to ₹36.1 crore in FY22. Gupta is followed by HUL's Sanjiv Mehta at ₹22 crore salary, Nestle's Suresh Narayanan (₹18.80 crore), Dabur India's Mohit Malhotra (₹14.60 crore) and ITC's Sanjiv Puri (₹12.59 crore).","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"business"},{"title":"Jet fuel prices cut by 2.2%; second reduction this year","content":"Aviation Turbine Fuel prices were reduced by 2.2% on Saturday, reflecting a fall in international oil prices. The prices were cut by ₹3,084.94 per kilolitre to ₹1,38,147.93\/kl. This is only the second reduction in rates this year. Prices had peaked at ₹1,41,232.87\/kl last month. Overall, ATF rates have been hiked 11 times since the start of this year. ","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"business"},{"title":"Sula Vineyards to go public, files IPO papers with SEBI","content":"Nashik-based Sula Vineyards has filed draft papers with the Securities and Exchange Board of India to raise capital through an IPO. The IPO will be entirely an offer for sale (OFS) with up to 25,546,186 equity shares put up for sale. The company has not finalised the date or price of the IPO as yet. ","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"business"},{"title":"Celsius becomes 3rd major crypto firm to file for bankruptcy in 3 weeks","content":"Celsius has become the third major crypto firm to file for bankruptcy in three weeks following the collapse of hedge fund Three Arrows Capital and broker Voyager Digital. The crypto lender said the decision was part of a financial restructuring that would \"stabilise the business\". The US-based platform had suspended customer withdrawals, swaps and transfers citing \"extreme market conditions\".","author":"Apurva Bharadwaj","date":"15 Jul","source":null,"category":"business"},{"title":"Crypto must come under auto info-exchange mechanism: FM Sitharaman to G20","content":"Finance Minister Nirmala Sitharaman told the group of 20 major economies to consider bringing cryptocurrencies under the ambit of the automatic exchange of information mechanism. The mechanism exists among countries to curb tax evasion. She said that investigations have shown tax evaders resorting to numerous layers of entities to mask their unaccounted wealth. ","author":"Apurva Bharadwaj","date":"15 Jul","source":null,"category":"business"},{"title":"RBI likely to introduce new rules for fintech firms: Report","content":"The Reserve Bank of India (RBI) is likely to announce new regulations for fintech companies, Moneycontrol reported. The rules will likely cover areas such as data sharing, privacy, compliance with KYC and anti-money laundering norms, the report said. This comes in the wake of complaints related to some fintechs charging usurious interest rates and other issues, the report added.","author":"Apurva Bharadwaj","date":"15 Jul","source":null,"category":"business"},{"title":"Adani Ports to buy Israel's Haifa Port with local firm for $1.18 bn","content":"Adani Ports and Special Economic Zone have won a bid to acquire Israel's Haifa Port with local firm Gadot Group for $1.18 billion, Israel announced on Thursday. Adani Ports and Special Economic Zone will have a 70% stake and Gadot will hold the remaining 30%. Adani Ports said the acquisition will boost trade lanes with its Indian ports.","author":"Apurva Bharadwaj","date":"15 Jul","source":null,"category":"business"},{"title":"6 of top 10 most valued firms lost ₹1.68 lakh crore in m-cap last week","content":"Among the 10 most valued firms, six companies suffered a combined loss of ₹1.68 lakh crore in their market valuation last week. While TCS took the biggest hit as its market valuation declined by ₹99,270.07 crore to reach ₹10,95,355.32 crore, it was followed by Infosys, whose valuation dropped by ₹35,133.64 crore to ₹6,01,900.14 crore.","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"business"},{"title":"Federal Bank's profit jumps 63% y-o-y to ₹600 crore, share price rises","content":"The share price of private sector lender Federal Bank rose by 1.54% to ₹98.80 after it reported a 63.5% increase in net profit in the April-June quarter to ₹600.66 crore. The bank had reported a profit of ₹367 crore in the same period last year. Meanwhile, its net interest income rose by 13% to ₹1,604.5 crore.","author":"Apurva Bharadwaj","date":"15 Jul","source":null,"category":"business"},{"title":"States' fiscal deficit may rise to ₹8.4 lakh cr due to high capex: ICRA","content":"States' fiscal deficit may rise to ₹8.4 lakh crore as they've budgeted 36% higher capital expenditure during 2022-23, an ICRA report said. As many as 26 large states, except Assam, have spent ₹5 lakh crore in capex, a 34% rise from FY20, it added. In budget estimates, these states have pegged their revenue receipts at ₹35.8 lakh crore.","author":"Apurva Bharadwaj","date":"15 Jul","source":null,"category":"business"},{"title":"She wasn't my mother's friend, gossip was spread by vested interests: Lalit Modi on Minal","content":"Former IPL Chairman Lalit Modi, in an Instagram post, clarified that his late wife Minal Modi wasn't his mother's friend. \"Departed love of my life Minal was my best friend for 12 years while she was married. She wasn't my mother's friend. That gossip was spread by vested interests,\" he wrote. Minal was nine years elder to Lalit.","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"sports"},{"title":"She yet again demonstrated her exceptional talent: PM on Sindhu winning Singapore Open","content":"Congratulating PV Sindhu on winning her first-ever Singapore Open title, PM Narendra Modi tweeted, \"She has yet again demonstrated her exceptional sporting talent and achieved success.\" He added, \"It is a proud moment for the country and will also give inspiration to upcoming players.\" Notably, Sindhu has won three titles in 2022 so far.","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"sports"},{"title":"BCCI had ₹40 cr in bank when I joined & ₹47,680 cr when I was banned: Lalit","content":"In an Instagram post, Lalit Modi asserted that he neither took any government favour nor any bribes from anyone. He added, “I was born with a diamond spoon...When I joined BCCI, it had ₹40 crore in the bank. I joined on my birthday on November 29, 2005. Guess what was in the bank when I was banned - ₹47,680 crore.\"","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"sports"},{"title":"India announce their playing XI for ODI series decider against England","content":"Team India captain Rohit Sharma won the toss and elected to bowl first against England in the ODI series decider in Manchester. India have made one change to their playing XI, with Jasprit Bumrah being replaced by Mohammed Siraj. Rohit revealed during the toss that Bumrah is missing out from the match due to a back spasm.","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"sports"},{"title":"Virat Kohli dances during warmup ahead of series decider, video goes viral","content":"A video has gone viral on social media showing former Team India captain Virat Kohli dancing during warmup ahead of the ODI series decider against England in Manchester. \"The most entertaining cricketer of recent times,\" a fan tweeted. \"He knows how to absorb pressure,\" wrote another. India are bowling first in the series decider.","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"sports"},{"title":"Sindhu's coach responds to trolls saying she won Singapore Open as top players didn't play","content":"PV Sindhu's coach Park Tae-sang took to Instagram to respond to trolls saying she won Singapore Open because top rankers didn't participate in the tournament. \"That doesn't mean Sindhu's win is anything but light, Light to shine It doesn't matter who participates, who doesn't,\" he wrote. \"Who can despise this win for her like that?\" he further wrote.","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"sports"},{"title":"Babar breaks Kohli's record, becomes fastest Asian batter to reach 10,000 int'l runs","content":"Pakistan captain Babar Azam on Sunday became the fastest Asian batter to reach 10,000 runs in international cricket, breaking Virat Kohli's record. The 27-year-old reached the 10,000-run mark during Pakistan's first innings in the first Test against Sri Lanka. Babar took 228 innings to reach the milestone. Kohli had set the previous record by taking 232 innings.","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"sports"},{"title":"A fighter to the core: Mahindra praises PV Sindhu after she wins Singapore Open","content":"Businessman Anand Mahindra took to Twitter to praise PV Sindhu after she won the Singapore Open. Sharing a tweet by Doordarshan Sports which had an old image of Sindhu, Mahindra wrote, \"That’s not just her facial expression, but the expression of her soul. A fighter to the core...Never getting demoralised by a slump. Teaching us how to rise again.\"","author":"Ridham Gambhir","date":"17 Jul","source":null,"category":"sports"},{"title":"Hardik Pandya records his best-ever bowling figures in ODI cricket","content":"Team India all-rounder Hardik Pandya on Sunday recorded his best-ever bowling figures in ODI cricket. The 28-year-old registered bowling figures of 7-3-24-4 in the third ODI against England at Old Trafford in Manchester. Notably, Pandya's best bowling figures in Test cricket (6-1-28-5) and T20I cricket (4-0-33-4) had also come in England.","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"sports"},{"title":"Virat Kohli gives tips to Siraj, he dismisses Root for duck next ball; video goes viral","content":"A video has gone viral on social media showing fast bowler Mohammed Siraj dismissing England's Joe Root for a duck a ball after being given tips by Virat Kohli. Root got out for a three-ball duck. Earlier in that over, Siraj dismissed Jonny Bairstow for a three-ball duck. Siraj finished with figures of 9-1-66-2 in the innings.","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"sports"},{"title":"Losing in quarters or semis was upsetting, finally I got this win: Sindhu","content":"Shuttler PV Sindhu has said winning the Singapore Open title, which is her third title victory of the year, \"means a lot\" to her. \"Back then in a couple of tournaments, there were many hard-fought matches and losing in the quarter-finals or semi-finals was very upsetting...and I have finally got the win. I hope this tempo continues,\" stated Sindhu. ","author":"Ankur Taliyan","date":"17 Jul","source":null,"category":"sports"},{"title":"Growth of franchise cricket is impacting international calendar: PCB","content":"Ahead of the announcement of the next cycle of the Future Tours Programme (FTP), the Pakistan Cricket Board (PCB) said it has asked the ICC to devise a way to regulate the growing T20 leagues. \"The growth of franchise cricket is impacting the already-crammed international cricket calendar...[we're] concerned about this development,\" PCB chief executive Faisal Hasnain said in a statement.","author":"Ankur Taliyan","date":"17 Jul","source":null,"category":"sports"},{"title":"India's 16-yr-old Praggnanandhaa wins Paracin Open chess title in Serbia","content":"Indian Grandmaster R Praggnanandhaa won Paracin Open 'A' chess tournament in Serbia on Saturday, scoring eight points from nine rounds. The 16-year-old remained unbeaten and finished half a point ahead of top seed Alexandr Predke, who finished at second spot with 7.5 points. Praggnanandhaa drew the seventh round with Predke and the ninth and final round with Kazakhstan's Alisher Suleymenov.","author":"Anant Kaur","date":"17 Jul","source":null,"category":"sports"},{"title":"Master craftsman: Ian Bishop on Babar Azam's 7th Test ton in Galle","content":"After Pakistan captain Babar Azam hit his seventh Test century in the side's first innings of first Test against Sri Lanka, Ian Bishop tweeted, \"Master craftsman; Babar...superb once again.\" Babar scored 119 runs off 244 balls in Galle. The 27-year-old hit 11 fours and two sixes during his knock. Overall, it is Babar's 25th international century. ","author":"Anant Kaur","date":"17 Jul","source":null,"category":"sports"},{"title":"When given responsibility, Hardik is a completely different cricketer: Shastri","content":"Ex-Team India head coach Ravi Shastri has said Hardik Pandya is a completely different cricketer when given extra responsibilities. \"He was picked by Gujarat Titans, where he was given the extra responsibility of captaining, which did him a world of good,\" added Shastri. Hardik was named Team India captain in the two-match T20I series against Ireland, which India won 2-0.","author":"Ankur Taliyan","date":"17 Jul","source":null,"category":"sports"},{"title":"Camaraderie with Rohit has been really good: Suryakumar","content":"India batter Suryakumar Yadav said his camaraderie with skipper Rohit Sharma has been really good. \"He's been watching me...talking to me since I played domestic cricket in Mumbai,\" he added. \"I've really felt him on the ground whenever he's leading. I've learned a lot from him...happy that he has shown a lot of confidence in me,\" he further said.\n","author":"Anant Kaur","date":"17 Jul","source":null,"category":"sports"},{"title":"Possible candidate for next India captain: Saba Karim on Rishabh Pant","content":"Praising Rishabh Pant, Saba Karim said the India wicketkeeper-batter is a special player and has match-winning abilities. \"I believe that he can emerge as a big player for India in all three formats. Looking at his performances overseas...we can say that he's a possible candidate for...next captain,\" he added. Pant led India in T20I series against South Africa last month.","author":"Anant Kaur","date":"17 Jul","source":null,"category":"sports"},{"title":"Such a threat: Bhogle on Siraj's double-wicket maiden over in 3rd England ODI","content":"Team India pacer Mohammed Siraj bowled a double-wicket maiden over, dismissing Jonny Bairstow and Joe Root on ducks, in the ongoing third ODI against England at Old Trafford. Reacting to this, commentator Harsha Bhogle tweeted, \"When Siraj takes the ball away, he becomes such a threat. I feared he was becoming a scrambled seam inward slant bowler. Excellent over.\"","author":"Ankur Taliyan","date":"17 Jul","source":null,"category":"sports"},{"title":"India's Anjum Moudgil wins bronze in Changwon Shooting World Cup","content":"India's Anjum Moudgil won a bronze medal in 50m Rifle 3 Positions Women at ISSF Shooting World Cup in Changwon, South Korea on Sunday. Anjum shot 402.9 in the final round to finish third. This is the 28-year-old's second straight individual World Cup medal of 2022. Anjum had won silver in the same event at Baku World Cup last month.","author":"Anant Kaur","date":"17 Jul","source":null,"category":"sports"},{"title":"Dhoni trusted me to win games when I was 22, it was massive: Lungi Ngidi","content":"South Africa pacer Lungi Ngidi has said it was \"massive\" for him when MS Dhoni backed him during his IPL debut in 2018 for CSK. \"Having someone of Dhoni's calibre put his trust in me to win him games when I was 22 was massive,\" he stated. Ngidi further said that IPL taught him how to handle a \"big crowd\".   ","author":"Ankur Taliyan","date":"17 Jul","source":null,"category":"sports"},{"title":"My mindset is the same in ODIs like it is in T20Is: Suryakumar Yadav","content":"India's Suryakumar Yadav has said he tries to play his natural game irrespective of the format. \"My mindset is the same in ODIs, I try to bat similar to how I do in T20Is...Even if the wickets are falling, I try to keep the scoreboard ticking,\" he stated. India will play the third and final ODI against England on Sunday. ","author":"Ankur Taliyan","date":"17 Jul","source":null,"category":"sports"},{"title":"Stunning performance: Anurag Thakur on Sindhu's 1st Singapore Open title","content":"Sports Minister Anurag Thakur took to Twitter to praise PV Sindhu following her title win at Singapore Open on Sunday. \"Stunning performance by Sindhu to clinch her first ever Singapore Open title...third title of 2022, she is looking in superb form!\" Third seeded Sindhu defeated Wang Zhi Yi of China 21-9, 11-21, 21-15 in 58 minutes.","author":"Anant Kaur","date":"17 Jul","source":null,"category":"sports"},{"title":"Nadal, who pulled out of Wimbledon, set to resume training from Monday","content":"Rafael Nadal is reportedly set to resume training from Monday in order to participate in the Canadian Open, which will begin on August 5 in Montreal. Nadal had pulled out of Wimbledon ahead of his semi-final due to an abdominal tear. \"Nadal really wants to come to Montreal and his hotel rooms are already booked,\" said tournament director Eugene Lapierre. ","author":"Ankur Taliyan","date":"17 Jul","source":null,"category":"sports"},{"title":"Your attitude to win inspires everyone: Sachin on Sindhu's Singapore Open win","content":"Taking to Twitter to congratulate PV Sindhu after she won the Singapore Open title, Sachin Tendulkar wrote, \"Your [Sindhu's] attitude and spirit to win every game is something that inspires everyone!\" He added, \"Many more to follow.\" Sindhu defeated China's Wang Zhi Yi 21-9, 11-21, 21-15 in the final to clinch her third title of the year.","author":"Anant Kaur","date":"17 Jul","source":null,"category":"sports"},{"title":"Indian team is struggling because Kohli is not among the runs: Akmal","content":"Pakistani cricketer Kamran Akmal said Team India is struggling because Virat Kohli is not among the runs, adding the side is heavily dependent on the batter. \"He has single-handedly won so many games for India...when he comes out of the rut, India's performance will also improve,\" he further said. Kohli scored 16 in India's 100-run loss against England at Lord's.   ","author":"Anant Kaur","date":"17 Jul","source":null,"category":"sports"},{"title":"Google to slow hiring for rest of the year: CEO Pichai tells employees","content":"Google CEO Sundar Pichai in an internal memo to the staff has announced that they will be \"slowing down the pace of hiring for the rest of the year\" amid an uncertain global economic outlook. He added, Google will focus on hiring for \"critical roles\" and will be \"pausing development\" in some cases and \"re-deploying resources to higher priority areas\". ","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Elon Musk's mother shares pics from his startup Zip2's opening event from 1997","content":"Tesla CEO Elon Musk's mother Maye Musk took to Twitter to share pictures of the opening of Zip2's global headquarters in Mountain View, California, in 1997. Zip2, a web software startup that created online city guides for newspapers, was the first company founded by Elon Musk. Earlier, a picture of Musk's 1995 business card of Zip2 went viral on Twitter.","author":"Hiral Goyal","date":"15 Jul","source":null,"category":"technology"},{"title":"IT Ministry says content removal on Twitter proportional to Indian user base: Report","content":"The Ministry of Electronics and Information Technology in an official review reportedly stated that the Centre's content removal orders to Twitter are \"proportional\" to the expanding Indian user base. The ministry said, \"India is 7% of Twitter's global user base and so is the volume of removal requests.\" Earlier, Twitter challenged the Centre's 39 blocking orders, saying that they're arbitrary. ","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"It is not a sacrifice at all: Bill Gates on plan to give away all his wealth","content":"Microsoft Co-founder Bill Gates, who plans to give away all his wealth, said, \"My giving this money is not a sacrifice at all.\" He added, \"I feel privileged to be involved in tackling these great challenges...and I believe I have an obligation to return my resources to society.\" Gates is currently the world's fourth richest person with $113 billion wealth.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"technology"},{"title":"Twitter down for thousands of users across the globe","content":"Twitter is down for thousands of users across the globe, according to outage tracking website Downdetector. The issues started with the service at around 5:40 pm IST, with a lot of users reporting 'over capacity' error messages. It is the first major Twitter outage since February, as per The Verge.","author":"Anmol Sharma","date":"14 Jul","source":null,"category":"technology"},{"title":"Unjustifiable request: Musk files motion against Twitter's bid to fast-track trial","content":"Tesla CEO Elon Musk has filed a motion opposing Twitter's request to fast-track a trial over the $44 billion deal, terming it an \"unjustifiable request\". While Twitter has requested the trial begin in September because the merger agreement with Musk terminates on October 25, Musk has requested a trial date on or after February 13, 2023. ","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"Elon has a real record of success: LinkedIn Co-founder defends Musk against Trump","content":"LinkedIn's billionaire Co-founder Reid Hoffman defended Tesla CEO Elon Musk after former US President Donald Trump called the former a \"bullshit artist\" over the $44 billion Twitter deal. Hoffman tweeted, \"Elon's a classic American immigrant story- an entrepreneur with a real record of success…[Whereas] Trump is a spoiled rich kid who bankrupts everything he touches. Including the US economy.\"","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Will prove our position in court & we believe we'll prevail: Twitter CEO to staff","content":"Following a lawsuit against Tesla CEO Elon Musk over the $44 billion acquisition agreement, Twitter CEO Parag Agrawal told his staff, \"We will prove our position in court and we believe we will prevail.\" Twitter's lawsuit has accused Musk of \"a long list\" of violations of the merger agreement that \"cast a pall over Twitter and its business\". \n","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Twitter's sudden speed for trial after 2 months of foot-dragging is a tactic: Musk","content":"Tesla CEO Elon Musk has opposed Twitter's request for a fast-track trial over the $44 billion deal termination. In a filing, Musk said, \"Twitter's sudden request for warp speed after two months of foot-dragging...is its latest tactic to shroud the truth about spam accounts long enough to railroad defendants into closing.\" Twitter has requested that the trial begin in September. \n","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"What a waste of time, energy & money: Mahindra on fallout of Elon Musk-Twitter deal","content":"Anand Mahindra has commented on the fallout of the $44-billion deal between Elon Musk and Twitter. \"What a waste of time, energy & money,\" he wrote. He added, \"Twitter's an indispensable source of news and connectedness. Can it be run like a quasi social enterprise...listed, for profit...but with...strong charter & managed by...board with directors who act responsibly like trustees?\"","author":"Anmol Sharma","date":"14 Jul","source":null,"category":"technology"},{"title":"Twitter uses Musk's old poop reaction to CEO's tweet as evidence in court, he reacts","content":"Twitter has used Tesla CEO Elon Musk's poop reaction to one of CEO Parag Agrawal's tweets on spam accounts in May as evidence against him in court. The Twitter lawsuit alleged that Musk has repeatedly disparaged Twitter and created business risk for the company. Meanwhile, reacting to this, Musk used another poop emoji and wrote, \"= bs\".","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Kerala becomes the only state with its own internet service: CM Vijayan","content":"Kerala has become the only state in India with its own internet service, CM Pinarayi Vijayan said on Thursday. \"The Kerala Fiber Optic Network Limited has received the ISP license from the Centre's Department of Telecommunications,\" he added. With this, Kerala's KFON project can kickstart its operations of providing internet as a basic right to our people, Vijayan further said.","author":"Atul Mishra","date":"15 Jul","source":null,"category":"technology"},{"title":"No plans for company-wide layoffs: Twitter amid lawsuit against Musk","content":"In a filing, Twitter has said that it isn't looking at company-wide layoffs but could continue to restructure the business. The filing comes a day after it sued Tesla CEO Elon Musk for violating his $44 billion deal. In May, Twitter said it would pause hiring and review all existing job offers to determine whether any \"should be pulled back\".","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Like all firms, we are not immune to economic headwinds: Google CEO to staff","content":"In an internal memo to the staff, Google CEO Sundar Pichai while announcing the company’s plan to slow its hiring, said, \"Like all companies, we’re not immune to economic headwinds\". He added, “The uncertain global economic outlook has been top of mind...We’ve never viewed these types of challenges as obstacles. Instead, we’ve seen them as opportunities to deepen our focus.\"","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Amazon pauses work on 6 new US office buildings to redesign for hybrid work","content":"Amazon is pausing construction of six new office buildings in Bellevue and Nashville as it seeks to redesign workspaces for hybrid work. \"We want to make sure that we design them in a way that meets our employees' needs in future,\" Amazon said. Amazon's plan to create 30,000 jobs in Bellevue and Nashville won't be affected by the construction pause.","author":"Hiral Goyal","date":"16 Jul","source":null,"category":"technology"},{"title":"Musk accused lawyers of causing trouble by seeking deal's financing info: Twitter","content":"In its lawsuit against Tesla CEO Elon Musk, Twitter has shared a purported image of a text message that Musk sent to CEO Parag Agrawal before terminating the deal. Musk's message read, \"Your lawyers are using these conversations to cause trouble….That needs to stop.\" Musk's message was in response to the company seeking information regarding the deal's financing.\n","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"MHA website ranks 1st among central ministry services portals: Govt","content":"The Ministry of Home Affairs has ranked first and its Digital Police portal second in a service delivery assessment of websites of central government ministries. The National e-Governance Service Delivery Assessment is a periodic assessment intended to improve the effectiveness of the states and Union Territories and the central government in the delivery of their online services to the public.","author":"Ridham Gambhir","date":"15 Jul","source":null,"category":"technology"},{"title":"Twitter's lawsuit against Musk gets 90-min 1st court hearing on July 19","content":"Twitter’s lawsuit against Tesla CEO Elon Musk over terminating the $44 billion acquisition deal will be first heard in court on July 19. Kathaleen McCormick, the Chancellor of Delaware's Court of Chancery, has set a 90-minute hearing. Notably, Twitter has requested that the trial begins in September because the merger agreement with Musk terminates on October 25.","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"Smartwatch-like wearable that operates without a battery developed in US","content":"Researchers at the University of California, Irvine, have developed a smartwatch-like wearable that can operate without an external power source or a battery. The 3D printed device is capable of keeping a track of the wearer's pulse and communicating wirelessly with a nearby smartphone. It uses an ultra-thin 2D material called MXene, which has unique electrical and mechanical properties.","author":"Hiral Goyal","date":"16 Jul","source":null,"category":"technology"},{"title":"Russian space agency chief Dmitry, known for clashes with Musk, fired","content":"Dmitry Rogozin, the Russian space agency chief who had frequent clashes online with SpaceX CEO Elon Musk, has been fired. While Kremlin did not provide a reason for removing him, Rogozin’s exit occurred on the same day that NASA and Roscosmos reached terms on a new agreement to collaborate on International Space Station missions despite the ongoing situation in Ukraine. ","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"11 SEBI officials' email accounts hacked & used to send 34 emails, FIR filed","content":"Mumbai police has filed an FIR after the Securities and Exchange Board of India (SEBI) approached them, alleging the email accounts of its 11 officials had been hacked and used to send as many as 34 emails by unknown persons. \"It was a small incident. CERT-IN is fully in the loop. No sensitive data was lost,\" the markets regulator said.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"technology"},{"title":"Netflix ties up with Microsoft for cheaper ad-supported subscription","content":"Netflix has announced a partnership with Microsoft for its ad-supported subscription plan. The technology giant will serve as a \"global advertising technology and sales partner\" for the streaming service. Netflix had announced in April that it was looking to offer a cheaper ad-supported option to its customers after nearly 200,000 subscribers left the platform in this year's first quarter.","author":"Apurva Bharadwaj","date":"15 Jul","source":null,"category":"technology"},{"title":"Ola Electric invests $100 mn in battery cell research: Report","content":"Ola Electric, the electric vehicle arm of Ola, has invested $100 million in lithium-ion battery cell research and development, according to reports from brokerages ICICI Securities and Edelweiss. CEO Bhavish Aggarwal unveiled the first indigenously developed lithium-ion battery cell. Ola will begin the mass production of the cell by 2023 and aims to develop the in-house capability by 2026.","author":"Anisha Joneja","date":"14 Jul","source":null,"category":"technology"},{"title":"RBI likely to introduce new rules for fintech firms: Report","content":"The Reserve Bank of India (RBI) is likely to announce new regulations for fintech companies, Moneycontrol reported. The rules will likely cover areas such as data sharing, privacy, compliance with KYC and anti-money laundering norms, the report said. This comes in the wake of complaints related to some fintechs charging usurious interest rates and other issues, the report added.","author":"Apurva Bharadwaj","date":"15 Jul","source":null,"category":"technology"},{"title":"If inflation calms down, Tesla can lower car prices: Musk","content":"Tesla CEO Elon Musk on Friday said that the electric car maker could lower prices for cars if inflation comes down. Responding to a user who asked him if Tesla had any plans to lower prices that it had raised amid the pandemic and supply chain woes, Musk replied, \"If inflation calms down, we can lower prices for cars.\"","author":"Ridham Gambhir","date":"16 Jul","source":null,"category":"technology"},{"title":"Sushmita reacts to being called 'gold digger' for dating Lalit Modi, says she's self made","content":"Actress Sushmita Sen took to Twitter to react to being called a 'gold digger' for dating ex-IPL Chairman Lalit Modi. Sushmita praised an article that called out trolls for attacking her over her relationship with Lalit. Alongside the article, she wrote, \"A self made woman.\" \"Ma'am these people (trolls) are just jealous souls,\" a Twitter user commented on Sushmita's post.","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Ileana D'Cruz dating Katrina Kaif's brother Sebastien: Reports","content":"Actress Ileana D'Cruz is in a relationship with UK-based model and Katrina Kaif's brother Sebastien Laurent Michel, according to reports. Sebastien and Ileana have reportedly been dating for about six months now. They both also went to attend Katrina's birthday celebration in Maldives, with Ileana sharing a picture with Sebastien, Katrina and Vicky Kaushal among others.","author":"Arshiya Chopra","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Quite a bit of my brain is missing: GoT actress Emilia on suffering 2 brain haemorrhages","content":"Opening up about suffering two brain haemorrhages in 2011 and 2013, Game of Thrones (GoT) actress Emilia Clarke said, \"There’s quite a bit [of my brain] missing!\" She added, \"The amount of my brain that is no longer usable...It’s remarkable that I am able to speak, sometimes articulately, and live my life completely normally with absolutely no repercussions.\"","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Lalit Modi reacts to 'trolling' over relation with Sushmita, calls media 'obsessed'","content":"Reacting to being trolled for tagging a wrong account while confirming his relationship with Sushmita Sen, Lalit Modi said, \"Why is the media so obsessed about trolling me?\" \"I guess we are still living in the Middle Ages that two people can't be friends & then if chemistry is right & timing is good- Magic can happen,\" he added.","author":"Arshiya Chopra","date":"17 Jul","source":null,"category":"entertainment"},{"title":"'The Office' star Craig Robinson cancels show after gunman opens fire in US club","content":"'The Office' star Craig Robinson cancelled his show after a gunman opened fire at a comedy club in North Carolina, US, where the comedian was scheduled to perform. \"I'm safe... It was wild. I was in the green room and they're like, 'Everybody get out!' It was a moment for sure,\" Robinson said in video posted on Instagram.","author":"Hiral Goyal","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Pic of Christopher Nolan's hand-drawn plot for his film 'Inception' goes viral","content":"A post showing the hand-drawn plot map of the Hollywood movie 'Inception' has gone viral on Twitter. The tweet by Julian Shapiro shows a paper depicting director Christopher Nolan's scribbling about the film's plot in detail. The plot map has been taken from the book 'The Nolan Variations: The Movies, Mysteries, and Marvels of Christopher Nolan' written by Tom Shone.","author":"Daisy Mowke","date":"16 Jul","source":null,"category":"entertainment"},{"title":"Always preferred diamonds, I still buy them myself: Sushmita on being called gold digger","content":"Reacting to being called a gold digger for dating Lalit Modi, Sushmita Sen penned a post on Instagram. She wrote, \"I dig deeper than gold...and I've always (famously) preferred diamonds! And yes I still buy them myself!\" \"It's heartbreaking to see just how miserable & unhappy the world around us is becoming,\" she wrote in the post.","author":"Anmol Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"There are songs in 'Brahmastra' that I've hidden away from Alia: Ayan","content":"'Brahmastra' director Ayan Mukerji revealed there are songs that he has \"hidden away\" from actress Alia Bhatt. During an Instagram Live session, a fan asked Ayan about the number of songs his film has. To this, he replied, \"I wouldn't like to reveal this at this time actually...There are songs (in Brahmastra) that I have hidden away even from Alia.\"","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Delhi Police uses Kareena's K3G character Poo to stop traffic violations","content":"The official Twitter handle of Delhi Police used actress Kareena Kapoor's character Poo from 2001 film 'Kabhi Khushi Kabhie Gham' to prevent people from jumping red lights. The video shows Poo as a red light saying her famous dialogue, \"Kaun hai yeh, jisne dobara mudkar mujhe nahi dekha (Who is this, who didn't turn around to see me again)?\"","author":"Kriti Kambiri","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Industry makes you stone, drills into you to seek your benefit: Neetu","content":"Actress Neetu Chandra, speaking about the film industry, has said, \"This industry makes you a stone; it drills into you to only seek your own benefit.\" She added there were times when she felt unwanted despite \"doing so much\". Neetu further stated, \"I always say physical strength leads to mental strength and good mental health...it's...important to speak about mental health.\"","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Not delusional, got attention because of who my parents are: Janhvi","content":"Actress Janhvi Kapoor has said she knows that the attention and recognition that has come her way is because of who her parents are. Janhvi, who is the daughter of producer Boney Kapoor and late actress Sridevi, added, \"There's a lot of clarity...I'm not delusional and thinking that I've earned all of it or I deserve any of it even.\"","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Our focus is to bring India to world through our stories: Joe Russo","content":"Director Joe Russo has said that India has a \"strong and fantastic film business\" just like the US. \"It's sadly not broken through on an international level consistently,\" he added. Joe further said that it is his and his brother Anthony Russo's \"special focus\" to bring some of the Indian talent and India to the world through their stories.","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"The terms I have coined are now part of pop culture: Kangana","content":"Actress Kangana Ranaut stated in an interview that her interviews, quotes and terms she has coined are now a part of pop culture. The actress added that she believes she knows the pulse of the audience. \"I do believe that the audience is looking for something which will stimulate their intellectual side and not just their sensual side,\" she said.","author":"Kriti Kambiri","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Awesomely outrageous roller-coaster: 'Doctor Strange' director on RRR","content":"Hollywood filmmaker Scott Derrickson, known for directing the 2016 film 'Doctor Strange', has said that he \"loved\" SS Rajamouli's 'RRR'. Taking to Twitter, he wrote, \"To celebrate my birthday last night, my wife, kids and I watched 'RRR', what an awesomely outrageous roller-coaster of a movie. Loved it.\" The film also featured Ram Charan and Jr NTR.","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Story of Bajrangi Bhaijaan 2 takes a 10-year leap: Vijayendra Prasad","content":"Writer Vijayendra Prasad said the sequel to Salman Khan-starrer 'Bajrangi Bhaijaan' will be a continuation of the first part. \"The story takes an eight to 10-year leap in 'Bajrangi Bhaijaan 2'. I'm hopeful...the sequel will be no less than the first part,\" he added. In an earlier interview, Kabir Khan said Salman chose 'Pawan Putra Bhaijaan' as the sequel's title.","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"I was told 'Be calculative; post more about work, less about parties': Janhvi","content":"Actress Janhvi Kapoor revealed in an interview that she has been told being calculative and maintaining a certain image is necessary to succeed in Bollywood. The actress further said that she was also told to put more content on social media about work so it doesn't seem like she is \"only doing yoga and partying and eating food\".","author":"Kriti Kambiri","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Ali Abbas Zafar to direct Hindi remake of 'The Transporter': Report","content":"Filmmaker Ali Abbas Zafar will reportedly be directing the official Hindi remake of the 2002 Hollywood film 'The Transporter'. A source revealed that producer Vishal Rana has bought the rights of the Jason Statham-starrer from international studio EuropaCorp. \"Vishal...approached Ali...who was...happy to come on board, not just as a director but also as a co-producer,\" the source added.","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Rajamouli wanted to direct 'Bajrangi...', couldn't over 'Baahubali': Writer","content":"'Bajrangi Bhaijaan' writer KV Vijayendra Prasad revealed his son SS Rajamouli wanted to direct the Salman Khan-starrer. He said he narrated the story to Rajamouli who cried but asked him to give the film away. \"Once the film...released, he...said, 'Papa...I was shooting the climax of 'Baahubali 1'...Had you asked me 10 days before or later, I'd have directed',\" Prasad added.","author":"Kriti Kambiri","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Demi Lovato cuts face on amethyst crystal, gets three stitches","content":"Singer Demi Lovato revealed that she recently cut her face on a huge amethyst crystal when she bent to pick something up, adding she needed three stitches. The injury came ahead of her appearance on talk show 'Jimmy Kimmel Live!' \"I did what any sane person would do and I made a TikTok before I even told anyone,\" Demi said.","author":"Kriti Kambiri","date":"16 Jul","source":null,"category":"entertainment"},{"title":"Akshay & Emraan-starrer 'Selfiee' to release on Feb 24, 2023","content":"Akshay Kumar and Emraan Hashmi-starrer 'Selfiee' will receive a theatrical release on February 24, 2023. The film is an official remake of the 2019 Malayalam film 'Driving Licence', which featured Prithviraj Sukumaran and Suraj Venjaramoodu. 'Selfiee' also features Diana Penty and Nushrratt Bharuccha. Akshay and Emraan will be sharing screen space in a film for the first time.","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Akshay & Suniel's 'Mohra' was a risky film with new faces: Director","content":"Filmmaker Rajiv Rai said his 1994 film 'Mohra' was a risky film with new faces. \"I thought Suniel Shetty...Akshay Kumar fit the part,\" he further added. Rajiv revealed late actress Divya Bharti, who he introduced in Bollywood with the film 'Vishwatma', was keen on doing the film. However, Raveena Tandon signed the film after things with Divya didn't work out.","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"It's true 'Rocky...' is delayed, still have song to shoot: Karan Johar","content":"Karan Johar has confirmed the reports that 'Rocky Aur Rani Ki Prem Kahani' has been delayed. \"It's true we're delayed. I...have a song to shoot. We were meant to shoot it this month...there were location issues in Europe,\" he stated. Karan added, \"Now, Alia (due to her pregnancy) won't be able to shoot until February 2023. We'll shoot...after her delivery.\"","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Man starts thinking of having kids when he's nearing 40: Ranbir","content":"Actor Ranbir Kapoor, speaking about the thought of having children, said, \"This...happens when a man is nearing 40.\" He added, \"You start thinking these things also, that 'when my child will be 20, I will be 60. Will I be able to play any sports, do things, go on any trek?'\" Ranbir's wife Alia Bhatt announced her pregnancy in June.","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"},{"title":"I was mistaken for Anil after 'JugJugg Jeeyo' screening: Sanjay","content":"Actor Sanjay Kapoor revealed he was mistaken for his elder brother Anil Kapoor after the screening of 'JugJugg Jeeyo'. He said a fan told him he was fantastic in the film, adding that he told her, \"Thank you...I'll convey it to my brother.\" \"It used to happen a lot. People used to get confused between Anil and [me],\" Sanjay said.","author":"Kriti Kambiri","date":"17 Jul","source":null,"category":"entertainment"},{"title":"Shamshera made for masses, this was something forgotten in B'wood: Sanjay","content":"Actor Sanjay Dutt has said that his upcoming film 'Shamshera' is made for the masses. \"'Shamshera' is an amazing film, the most commercial film I have come across in recent times...This is the kind of work I've done all my life, but it got somewhere forgotten in Bollywood,\" he added. The film also features Ranbir Kapoor and Vaani Kapoor.","author":"Amartya Sharma","date":"17 Jul","source":null,"category":"entertainment"}]